       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISPLAY-GREETING.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  GREETING PIC A(5) VALUE "HELLO".
       01  ANSWER PIC 9 VALUE 1.

       PROCEDURE DIVISION.
       MAIN.
           GO TO DISPLAY-HELLO DEPENDING ON ANSWER.
           DISPLAY "END OF PROGRAM"
           STOP RUN.

       DISPLAY-HELLO.
           DISPLAY GREETING
           DISPLAY "CONTINUE GREETING? (1 IF YES/2 IF NO): "
           ACCEPT ANSWER.
           GO TO DISPLAY-HELLO DEPENDING ON ANSWER.
           GO TO MAIN.

       END PROGRAM DISPLAY-GREETING.
