       IDENTIFICATION DIVISION. 
       PROGRAM-ID. SEQ-TO-INDEX.
       AUTHOR. KA HOU, CHOI.

       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 
           SELECT 
              VIDEO-FILE ASSIGN TO "IDXVIDEO"
              ORGANIZATION IS INDEXED 
              ACCESS MODE IS RANDOM
              RECORD KEY IS VIDEO-CODE
              ALTERNATE RECORD KEY IS VIDEO-TITLE
                 WITH DUPLICATES
              FILE STATUS IS VIDEO-STATUS.

           SELECT 
              SEQ-VIDEO-FILE ASSIGN TO "SEQVIDEO.DAT"
              ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION. 
       FILE SECTION. 
       FD  VIDEO-FILE.
       01  VIDEO-REC.
           02 VIDEO-CODE PIC 9(5).
           02 VIDEO-TITLE PIC X(40).
           02 VIDEO-SUPPLIER-CODE PIC 99.

       FD SEQ-VIDEO-FILE.
       01  SEQ-VIDEO-REC.
           88 END-OF-FILE VALUE HIGH-VALUES.
           02 SEQ-VIDEO-CODE PIC 9(5).
           02 SEQ-VIDEO-TITLE PIC X(40).
           02 SEQ-VIDEO-SUPPLIER-CODE PIC 99.

       WORKING-STORAGE SECTION. 
       01 VIDEO-STATUS PIC X(2).

       PROCEDURE DIVISION.
       MAIN.
           OPEN INPUT  SEQ-VIDEO-FILE.
           OPEN OUTPUT VIDEO-FILE.

           READ SEQ-VIDEO-FILE
              AT END SET END-OF-FILE TO TRUE 
           END-READ

           PERFORM UNTIL END-OF-FILE
              WRITE VIDEO-REC FROM SEQ-VIDEO-REC
                 INVALID KEY DISPLAY "VIDEO STATUS :- ", VIDEO-STATUS 
              END-WRITE
              READ SEQ-VIDEO-FILE
                 AT END SET END-OF-FILE TO TRUE
              END-READ
           END-PERFORM.

           CLOSE VIDEO-FILE, SEQ-VIDEO-FILE.
           STOP RUN.

       END PROGRAM SEQ-TO-INDEX.
