       IDENTIFICATION DIVISION. 
       PROGRAM-ID. SEQ-TO-RELATIVE.
       AUTHOR. KA HOU, CHOI.

       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 
           SELECT 
              SUPPLIER-FILE ASSIGN TO "RELSUPP.DAT"
              ORGANIZATION IS RELATIVE
              ACCESS MODE IS RANDOM
              RELATIVE KEY IS SUPPLIER-KEY
              FILE STATUS IS SUPPLIER-STATUS.

           SELECT 
              SUPPLIER-FILE-SEQ ASSIGN TO "SEQSUPP.DAT"
              ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION. 
       FILE SECTION. 
       FD  SUPPLIER-FILE.
       01  SUPPLIER-REC.
           02 SUPPLIER-CODE PIC 99.
           02 SUPPLIER-NAME PIC X(20).
           02 SUPPLIER-ADDR PIC X(50).

       FD SUPPLIER-FILE-SEQ.
       01  SUPPLIER-REC-SEQ.
           88 END-OF-FILE VALUE HIGH-VALUES.
           02 SUPPLIER-CODE-SEQ PIC 99.
           02 SUPPLIER-NAME-SEQ PIC X(20).
           02 SUPPLIER-ADDR-SEQ PIC X(50).

       WORKING-STORAGE SECTION. 
       01  SUPPLIER-STATUS PIC X(2).
       01  SUPPLIER-KEY PIC 99.

       PROCEDURE DIVISION.
       MAIN.
           OPEN OUTPUT SUPPLIER-FILE.
           OPEN INPUT SUPPLIER-FILE-SEQ.

           READ SUPPLIER-FILE-SEQ 
              AT END SET END-OF-FILE TO TRUE
           END-READ
           PERFORM UNTIL END-OF-FILE 
              MOVE SUPPLIER-CODE-SEQ TO SUPPLIER-KEY
              MOVE SUPPLIER-REC-SEQ TO SUPPLIER-REC 
              WRITE SUPPLIER-REC 
                 INVALID KEY DISPLAY "SUPPLIER STATUS = " 
                    SUPPLIER-STATUS
              END-WRITE
              READ SUPPLIER-FILE-SEQ 
                 AT END SET END-OF-FILE TO TRUE
              END-READ
           END-PERFORM.

           CLOSE SUPPLIER-FILE, SUPPLIER-FILE-SEQ.
           STOP RUN.

       END PROGRAM SEQ-TO-RELATIVE.
